# Lab | Pandas

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

The data includes information such as customer ID, state, gender, education, income, and other variables that can be used to perform various analyses.

Throughout the lab, we will be using the pandas library in Python to manipulate and analyze the data. Pandas is a powerful library that provides various data manipulation and analysis tools, including the ability to load and manipulate data from a variety of sources, including CSV files.

### Data Description

- Customer - Customer ID

- ST - State where customers live

- Gender - Gender of the customer

- Education - Background education of customers 

- Customer Lifetime Value - Customer lifetime value(CLV) is the total revenue the client will derive from their entire relationship with a customer. In other words, is the predicted or calculated value of a customer over their entire duration as a policyholder with the insurance company. It is an estimation of the net profit that the insurance company expects to generate from a customer throughout their relationship with the company. Customer Lifetime Value takes into account factors such as the duration of the customer's policy, premium payments, claim history, renewal likelihood, and potential additional services or products the customer may purchase. It helps insurers assess the long-term profitability and value associated with retaining a particular customer.

- Income - Customers income

- Monthly Premium Auto - Amount of money the customer pays on a monthly basis as a premium for their auto insurance coverage. It represents the recurring cost that the insured person must pay to maintain their insurance policy and receive coverage for potential damages, accidents, or other covered events related to their vehicle.

- Number of Open Complaints - Number of complaints the customer opened

- Policy Type - There are three type of policies in car insurance (Corporate Auto, Personal Auto, and Special Auto)

- Vehicle Class - Type of vehicle classes that customers have Two-Door Car, Four-Door Car SUV, Luxury SUV, Sports Car, and Luxury Car

- Total Claim Amount - the sum of all claims made by the customer. It represents the total monetary value of all approved claims for incidents such as accidents, theft, vandalism, or other covered events.

External Resources: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

## Challenge 1: Understanding the data

In this challenge, you will use pandas to explore a given dataset. Your task is to gain a deep understanding of the data by analyzing its characteristics, dimensions, and statistical properties.

- Identify the dimensions of the dataset by determining the number of rows and columns it contains.
- Determine the data types of each column and evaluate whether they are appropriate for the nature of the variable. You should also provide suggestions for fixing any incorrect data types.
- Identify the number of unique values for each column and determine which columns appear to be categorical. You should also describe the unique values of each categorical column and the range of values for numerical columns, and give your insights.
- Compute summary statistics such as mean, median, mode, standard deviation, and quartiles to understand the central tendency and distribution of the data for numerical columns. You should also provide your conclusions based on these summary statistics.
- Compute summary statistics for categorical columns and providing your conclusions based on these statistics.

In [5]:
# Your code here
import pandas as pd
# insurance data named as data to facilitate the process
data = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")
data.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [6]:
data.shape
#data has 4.008 columns and 11 rows.

(4008, 11)

In [7]:
# Description of the data in the dataframe
data.describe()

             Income  Monthly Premium Auto  Total Claim Amount
count   1071.000000           1071.000000         1071.000000
mean   39295.701214            193.234360          404.986909
std    30469.427060           1601.190369          293.027260
min        0.000000             61.000000            0.382107
25%    14072.000000             68.000000          202.157702
50%    36234.000000             83.000000          354.729129
75%    64631.000000            109.500000          532.800000
max    99960.000000          35354.000000         2893.239678

In [9]:
data.dtypes
#insurance data contains a mix of data types due to object type in terms of data preparation, 
# e.g., Customer Lifetime Value, number of open complaints. 
# Customer Lifetime Value is the main KPI regarding the business goal.

Customer                      object
ST                            object
GENDER                        object
Education                     object
Customer Lifetime Value       object
Income                       float64
Monthly Premium Auto         float64
Number of Open Complaints     object
Policy Type                   object
Vehicle Class                 object
Total Claim Amount           float64
dtype: object

In [21]:
#Identify the number of unique values for each column - We did learn on 03 April, 
data.describe(include=[object]).T

                          count unique            top freq
Customer                   1071   1071        RB50392    1
ST                         1071      8         Oregon  320
GENDER                      954      5              F  457
Education                  1071      6       Bachelor  324
Customer Lifetime Value    1068   1027     445811.34%    4
Number of Open Complaints  1071      6         1/0/00  830
Policy Type                1071      3  Personal Auto  780
Vehicle Class              1071      6  Four-Door Car  576

In [11]:
data["Education"].nunique()

6

In [43]:
# The missing value per columns. 
# Acc. to high number of missing values in the data, the insights from the data analysis needs to be considered wisely.
data.isna().sum()

Customer                     2937
ST                           2937
GENDER                       3054
Education                    2937
Customer Lifetime Value      2940
Income                       2937
Monthly Premium Auto         2937
Number of Open Complaints    2937
Policy Type                  2937
Vehicle Class                2937
Total Claim Amount           2937
dtype: int64

In [12]:
# to show the percentage of null values in a column
round(data.isna().sum()/len(data),4)*100

Customer                     73.28
ST                           73.28
GENDER                       76.20
Education                    73.28
Customer Lifetime Value      73.35
Income                       73.28
Monthly Premium Auto         73.28
Number of Open Complaints    73.28
Policy Type                  73.28
Vehicle Class                73.28
Total Claim Amount           73.28
dtype: float64

In [24]:
# to define number of unique values support to understand how clean the data might be. 
# In this data, e.g. there are five values for "Gender". That might be prepared for gender based marketing campaigns.  
# Categorical Values => ST, Gender, Education, Policy Type, Vehicle Class
data.nunique()

Customer                     1071
ST                              8
GENDER                          5
Education                       6
Customer Lifetime Value      1027
Income                        774
Monthly Premium Auto          132
Number of Open Complaints       6
Policy Type                     3
Vehicle Class                   6
Total Claim Amount            761
dtype: int64

In [33]:
data["Income"].mean

<bound method Series.mean of 0           0.0
1           0.0
2       48767.0
3           0.0
4       36357.0
         ...
4003        NaN
4004        NaN
4005        NaN
4006        NaN
4007        NaN
Name: Income, Length: 4008, dtype: float64>

In [8]:
data['Income'].value_counts(dropna=False)
# Unique values for Income categorization

Income
NaN        2937
0.0         252
43860.0       4
17622.0       4
14072.0       3
           ...
58557.0       1
25632.0       1
18768.0       1
47945.0       1
55873.0       1
Name: count, Length: 775, dtype: int64

In [36]:
data['GENDER'].value_counts(dropna=False)
# Unique values for GENDER categorization

GENDER
NaN       3054
F          457
M          413
Male        39
female      28
Femal       17
Name: count, dtype: int64

In [14]:
# GENDER names cleaning process
# Use string functions to standardize the states to uppercase and use the strip function to clean the strings as well.
data['GENDER'].unique()

def clean(x):
    if x in ['female', 'Femal', 'female']:
        return 'F'
    elif x in ['Male']:
        return 'M'
    else:
        return x

data['GENDER'] = list(map(clean,data['GENDER']))
data['GENDER'].unique()    

data['GENDER'].value_counts(dropna=False)

GENDER
NaN    3054
F       502
M       452
Name: count, dtype: int64

In [15]:
#Identify the number of unique values for each column - We did learn on 03 April, 
data.describe(include=[object]).T

                          count unique            top freq
Customer                   1071   1071        RB50392    1
ST                         1071      5     California  331
GENDER                      954      2              F  502
Education                  1071      6       Bachelor  324
Customer Lifetime Value    1068   1027     445811.34%    4
Number of Open Complaints  1071      6         1/0/00  830
Policy Type                1071      3  Personal Auto  780
Vehicle Class              1071      6  Four-Door Car  576

In [16]:
data['GENDER'].value_counts()

GENDER
F    502
M    452
Name: count, dtype: int64

In [83]:
data['Vehicle Class'].value_counts(dropna=False)
# Unique values for Vehicle Class categorization

Vehicle Class
NaN              2937
Four-Door Car     576
Two-Door Car      205
SUV               199
Sports Car         57
Luxury SUV         20
Luxury Car         14
Name: count, dtype: int64

In [39]:
# Unique values for Education categorization
data["Education"].value_counts(dropna=False)

Education
NaN                     2937
Bachelor                 324
College                  313
High School or Below     296
Master                    94
Doctor                    37
Bachelors                  7
Name: count, dtype: int64

In [41]:
# Unique values for Policy Type categorization
data["Policy Type"].value_counts(dropna=False)

Policy Type
NaN               2937
Personal Auto      780
Corporate Auto     234
Special Auto        57
Name: count, dtype: int64

In [10]:
# the State names were replaced. e.g., WA replaced with Washington. 
# Use string functions to standardize the states to uppercase and use the strip function to clean the strings as well.
data['ST'].unique()

def clean(x):
    if x in ['AZ']:
        return 'Arizona'
    elif x in ['Cali']:
        return 'California'
    elif x in ['WA']:
        return 'Washington'
    else:
        return x

data['ST'] = list(map(clean,data['ST']))
data['ST'].unique()    

data['ST'].value_counts(dropna=False)

ST
NaN           2937
California     331
Oregon         320
Arizona        211
Washington     111
Nevada          98
Name: count, dtype: int64

In [11]:
# Unique values for State categorization
data["ST"].value_counts(dropna=False)

ST
NaN           2937
California     331
Oregon         320
Arizona        211
Washington     111
Nevada          98
Name: count, dtype: int64

In [13]:
#Identify the number of unique values for each column - We did learn on 03 April, 
data.describe(include=[object]).T

                          count unique            top freq
Customer                   1071   1071        RB50392    1
ST                         1071      5     California  331
GENDER                      954      5              F  457
Education                  1071      6       Bachelor  324
Customer Lifetime Value    1068   1027     445811.34%    4
Number of Open Complaints  1071      6         1/0/00  830
Policy Type                1071      3  Personal Auto  780
Vehicle Class              1071      6  Four-Door Car  576

## Challenge 2: analyzing the data

### Exercise 1

The marketing team wants to know the top 5 less common customer locations. Create a pandas Series object that contains the customer locations and their frequencies, and then retrieve the top 5 less common locations in ascending order.

In [13]:
# Customer location data 
Customer_Locations = data["ST"]
# Series with location counts
location_counts = pd.Series(Customer_Locations).value_counts()
# The top 5 less common locations (*ascending order)
Top_less_locations = location_counts.nsmallest(5)
Top_less_locations

ST
AZ             25
WA             30
Washington     81
Nevada         98
Cali          120
Name: count, dtype: int64

### Exercise 2

The sales team wants to know the total number of policies sold for each type of policy. Create a pandas Series object that contains the policy types and their total number of policies sold, and then retrieve the policy type with the highest number of policies sold.

*Hint:*
- *Using value_counts() method simplifies this analysis.*
- *Futhermore, there is a method that returns the index of the maximum value in a column or row.*

In [75]:
# Unique values for Policy Type categorization
data["Policy Type"].value_counts(dropna=False)

Policy Type
NaN               2937
Personal Auto      780
Corporate Auto     234
Special Auto        57
Name: count, dtype: int64

In [82]:
# Policy Types
Policy_Type = {'Personal Auto',
               'Corporate Auto',
               'Special Auto'}
# Policy type counts (Series)
Policy_counts = df.sum(axis=0)
# Policy type with the most policies sold
Most_Popular_Policy = Policy_counts.idxmax()
print(f"Policy type with the most policies sold: {most_popular_policy}")

Policy type with the most policies sold: Personal Auto

### Exercise 3

The sales team wants to know if customers with Personal Auto have a lower income than those with Corporate Auto. How does the average income compare between the two policy types?

- Use *loc* to create two dataframes: one containing only Personal Auto policies and one containing only Corporate Auto policies.
- Calculate the average income for each policy.
- Print the results.

In [18]:
##
# to create two DataFrames for Personal and Corporate Auto | using loc
data_personal_auto = data.loc[data['Policy Type'] == 'Personal Auto']
data_corporate_auto = data.loc[data['Policy Type'] == 'Corporate Auto']

# Average income calculation for each policy type
avg_income_personal = data_personal_auto['Income'].mean()
avg_income_corporate = data_corporate_auto['Income'].mean()

print(f"Average income (Personal Auto): ${avg_income_personal:.2f}")
print(f"Average income (Corporate Auto): ${avg_income_corporate:.2f}")

# Comparison logic
if avg_income_personal < avg_income_corporate:
    print("Customers with Personal Auto have a lower average income.")
elif avg_income_personal > avg_income_corporate:
    print("Customers with Corporate Auto have a lower average income.")
else:
    print("Average income is the same for both policy types.")

Average income (Personal Auto): $38180.70
Average income (Corporate Auto): $41390.31
Customers with Personal Auto have a lower average income.

### Bonus: Exercise 4

Your goal is to identify customers with a high policy claim amount.

Instructions:

- Review again the statistics for total claim amount to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount data.

*Note: When analyzing data, we often want to focus on certain groups of values to gain insights. Percentiles are a useful tool to help us define these groups. A percentile is a measure that tells us what percentage of values in a dataset are below a certain value. For example, the 75th percentile represents the value below which 75% of the data falls. Similarly, the 25th percentile represents the value below which 25% of the data falls. When we talk about the top 25%, we are referring to the values that fall above the 75th percentile, which represent the top quarter of the data. On the other hand, when we talk about the bottom 25%, we are referring to the values that fall below the 25th percentile, which represent the bottom quarter of the data. By focusing on these groups, we can identify patterns and trends that may be useful for making decisions and taking action.*

*Hint: look for a method that gives you the percentile or quantile 0.75 and 0.25 for a Pandas Series.*

*Hint 2: check `Boolean selection according to the values of a single column` in https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9*

In [ ]:
# Your code here